app/controllers/api/v1/lists_controller.rb

INSERT INTO "lists" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "mylist"], ["description", "randon favorites"], ["user_id", 4], ["created_at", "2023-02-09 18:25:40.384561"], ["updated_at", "2023-02-09 18:25:40.384561"]]
---
    def create
        @list = current_user.lists.new(list_params)
        if @list.save

UPDATE "lists" SET "name" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["name", "comedy"], ["updated_at", "2023-02-09 18:35:08.875784"], ["id", 1]]
---
    def update
        if @list.update(list_params)

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
---
    def set_list
        @list = current_user.lists.find(params[:id])